
osentry: proc() options(main);

dcl sysprint file output;
dcl ltrim builtin;
dcl c_isodate entry() returns(char(23));
dcl c_date_e entry() returns(char(8));
dcl c_date_m entry() returns(char(9) varying);
dcl c_date_n entry() returns(char(10));
dcl c_date_u entry() returns(char(8));
dcl c_date_w entry() returns(char(9) varying);
dcl c_date_o entry() returns(char(8));
dcl c_date_s entry() returns(char(8));
dcl c_time_l entry() returns(char(12));
dcl c_time_c entry() returns(char(8));
dcl c_time_h entry() returns(char(2));
dcl c_time_m entry() returns(char(4) varying);
dcl c_time_s entry() returns(char(5) varying);

put skip edit('Starting tests.') (a);

put skip edit('Current iso date.') (a);
put skip edit(c_isodate()) (a(23));

put skip edit('Current date in European format.') (a);
put skip edit(c_date_e()) (a);

put skip edit('Current month is.') (a);
put skip edit(c_date_m()) (a);

put skip edit('Current date in normal format.') (a);
put skip edit(c_date_n()) (a);

put skip edit('Current date in USA format.') (a);
put skip edit(c_date_u()) (a);

put skip edit('Current weekday is.') (a);
put skip edit(c_date_w()) (a);

put skip edit('Current ordered date is.') (a);
put skip edit(c_date_o()) (a);

put skip edit('Current standard date is.') (a);
put skip edit(c_date_s()) (a);

put skip edit('Current formatted time is.') (a);
put skip edit(c_time_l()) (a);

put skip edit('Current civil time is.') (a);
put skip edit(c_time_c()) (a);

put skip edit('Current number of hours since midnight.') (a);
put skip edit(c_time_h()) (a);

put skip edit('Current number of minutes since midnight.') (a);
put skip edit(c_time_m()) (a);

put skip edit('Current number of seconds since midnight.') (a);
put skip edit(c_time_s()) (a);

return;

end osentry;







